
#include <my_rpProV2.h>
#include <myrp_prov2_chea2.h>

void setup() {
  setup_rp2350_pro();
  set_motor();
  Setting() ;

  //arm_up_close();  //--->> ยกแขนขึ้นหุบฝ่ามือเข้า
  // arm_down_open();
  arm_up_open();
  SW();  //--->> คำสั่งรอกดปุ่ม


  ////------------------------------------------------------------------------------>> รันคำสั่งต่าง ๆ ที่นี่

  Mission();


  ////------------------------------------------------------------------------------>> จบการรันคำสั่งต่าง ๆ

  MotorStop();
}

void loop() {
  
  SW();  //--->> คำสั่งรอกดปุ่ม
  Mission();
 
}
